package banyuan.com;

public class Bitperation {

    public static void main(String[] args) {
       //  >>  <<   >>>
        int  a=-9; // 位移   指的的底层  补码的位移
        System.out.println(a>>>3);
        /* 1 0000 0000 0000 0000 0000 0000 0000 1001
           0 1111 1111 1111 1111 1111 1111 1111 0110
      补码  0 0001 1111 1111 1111 1111 1111 1111 1110

              0111 1111
              >>> 不考虑最高位的正负
              -9

         */
        System.out.println(0b11111111111111111111111111110);
        /*
               正数的源码 反码  补码都是本身
               负数的源码：是负数本身的绝对值的源码
               反码：源码取反    最高位取反
               补码：反码+1

         */

//        1000 0000 0000 0000 0000 0000 0000 0010
//        0111 1111 1111 1111 1111 1111 1111 1101

//        0111 1111 1111 1111 1111 1111 1111 1101

//        0111 1111 1111 1111 1111 1111 1110 1111；
//        1000 0000 0000 0000 0000 0000 0001 0000


    }
}
